org-config.org
* Org-babel
** haskell formatter
#+begin_src emacs-lisp
  ;;(format "%s"
  ;;        (replace-regexp-in-string
  ;;         (rx line-start
  ;;             (+ (| alphanumeric blank "." "|" ">")))
  ;;         "" (format "%s" strr)))
#+end_src

This is to add biblatex as bibliography processor

* Paperwriting-stuff
** Biblatex as citation driver
#+begin_src emacs-lisp :exports code
  (require 'oc-biblatex)
   (setq org-cite-export-processors
        '((latex biblatex)
          (t csl)))
#+end_src

#+RESULTS:
| latex | biblatex |
| t     | apa      |

** Glossary

#+begin_src emacs-lisp
  (require 'org-ref)
  (add-hook 'org-export-before-parsing-hook 'org-ref-acronyms-before-parsing)
  (add-hook 'org-export-before-parsing-hook 'org-ref-glossary-before-parsing)
#+end_src

#+RESULTS:
| org-ref-glossary-before-parsing | org-ref-acronyms-before-parsing |

** Subfigures
#+begin_src emacs-lisp
;; (package-initialize)
(use-package ox-latex-subfigure
  :init
  (setq org-latex-prefer-user-labels t)
  :load-path "~/Dropbox/ProjectWeekends/lisp/ox-latex-subfigure/"
  :config (require 'ox-latex-subfigure))
#+end_src

* Export to Jupiter notebook
from github
#+begin_src emacs-lisp
  (use-package ox-ipynb

    :quelpa (ox-ipynb :fetcher github
                     :repo "jkitchin/ox-ipynb"
                     :branch "master"
                     :files ("dist" "*.el"))
      :ensure t
      :after ox
      :config
      (require 'ox-ipynb))
#+end_src

#+RESULTS:
: t
* Customization of TODOS
** Customization of TODO keywords
Cycle between the states:
- TODO
- IN-PROGRESS or BLOCKED
- DONE or CANCELED

#+begin_src emacs-lisp
  (setq org-todo-keywords
        '((sequence "TODO(t)" "IN-PROGRESS(p)" "BLOCKED(b@/!)" "|" "DONE(d/!)" "CANCELED(c@/!)")))
#+end_src

#+RESULTS:
| sequence | TODO(t) | IN-PROGRESS(p) | BLOCKED(b@/!) |   |   | DONE(d/!) | CANCELED(c@/!) |

** Pretty export

#+begin_src emacs-lisp
  (defun my-org-latex-format-headline-function
      (todo todo-type priority text tags _info)
    "Default format function for a headline.
  See `org-latex-format-headline-function' for details."
    (concat
     (and todo (format "{\\bfseries\\sffamily\\color{%s} \\framebox{%s}} "
                       (pcase todo-type
                         ('todo "orange")
                         ('done "olive"))
                       todo))
     (and priority (format "\\framebox{\\#%c} " priority))
     text
     (and tags
      (format "\\hfill{}\\textsf{%s}"
          (mapconcat #'org-latex--protect-text tags ":")))
     ))

  (setq org-latex-format-headline-function 'my-org-latex-format-headline-function)
#+end_src

#+RESULTS:
: my-org-latex-format-headline-

* LaTeX-Export
** Load custom classes
Load "legacy" stuff:
#+begin_src emacs-lisp
  (load "~/.emacs.d/lisp/org-xelatex.el")
  (load "~/.emacs.d/lisp/org-tex-local-class.el")
  (load "~/.emacs.d/lisp/org-latex-classes.el")
#+end_src

Load classes I implemented in org-files:
AJC formal, informal and letter
#+begin_src emacs-lisp
  ;(org-babel-load-file "~/.emacs.d/org-latex-ajc.org")
#+end_src

Load tufte layout which I defined in org file ox-latex/ox-tufte.org
#+begin_src emacs-lisp
    (org-babel-load-file "~/.emacs.d/ox-latex/ox-tufte.org")
#+end_src

#+RESULTS:

* Org-structure templates
Defines some templates to be inserted with =org-insert-structure-template= or =C-c C-,=.

** Code-Blocks

#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-structure-template-alist
               '("selisp" . "SRC emacs-lisp"))
  (add-to-list 'org-structure-template-alist
               '("slatex" . "SRC latex"))
  (add-to-list 'org-structure-template-alist
               '("spython" . "SRC python :results value :exports both :session :async"))

#+END_SRC

#+RESULTS:
: ((spython . SRC python :results value :exports both :session :async) (slatex . SRC latex) (selisp . SRC emacs-lisp) (el . SRC emacs-lisp) (a . export ascii) (c . center) (C . comment) (e . example) (E . export) (h . export html) (l . export latex) (q . quote) (s . src) (v . verse))

* PDF as inline images

Install package from github https://github.com/shg/org-inline-pdf.el.git and add org-inline-pdf-mode to the org mode hook
#+begin_src emacs-lisp
  (use-package org-inline-pdf :quelpa (org-inline-pdf :fetcher github :repo "shg/org-inline-pdf.el")
    :ensure t
    :config
    (add-hook 'org-mode-hook 'org-inline-pdf-mode))
#+end_src

#+RESULTS:
: t

* Org-phscroll
To fix the damn autowrapping of tables (and code blocks) in org mode, use the package org-phscroll
#+begin_src emacs-lisp
  (use-package phscroll
    :quelpa (phscroll
  			 :fetcher github
  			 :repo "misohena/phscroll"
  			 :files ("phscroll.el" "org-phscroll.el")
  			 )
    :ensure t
    :config
    (add-hook 'org-mode-hook 'phscroll-mode))
#+end_src

#+RESULTS:
: t

